description = [
            '''Экран: 6,8-дюймовый OLED (3200 x 1400; 1–120 Гц) 
ЦП: Snapdragon 8 Gen 2 
Оперативная память: 8 ГБ, 12 ГБ 
Память: 256 ГБ, 512 ГБ, 1 ТБ 
Задняя камера: 200 МП в ширину (f/1,7), 12 МП сверхширокая (ƒ/2,2), 10-мегапиксельная телефото (3-кратный зум, f/2,4), 
10-мегапиксельная телефото (10-кратный зум, f/4,9) 
Фронтальная камера: 12-мегапиксельная (ƒ/2,2) 
Вес: 232 г
Время работы батареи (часы:минуты): 13:09''',

               '''Экран: 6,7-дюймовый OLED (2796 x 1290; 1-120 Гц)
Процессор: A17 Pro
Оперативная память: 8 ГБ
Хранилище / расширяемое: 256 ГБ, 512 ГБ, 1 ТБ
Задняя камера: 48МП (f/1,78), 12МП сверхширокоугольная (ƒ/2,2), 12МП телеобъектив (5-кратный зум; f/2,8)
Фронтальная камера: 12 МП (ƒ/1,9)
Вес: 221 г
Время автономной работы (часы:минуты): 14:02''',

               '''Экран: 6,7-дюймовый OLED (2400×1080)
Процессор: Tensor G2
Оперативная память: 12 ГБ
Хранение: 128 ГБ/256 ГБ/512 ГБ
Основная камера: 50 МП + 48 МП + 12 МП
Фронтальная камера: 10,8 МП
Вес: 212 г
Емкость батареи: 4355 мАч''',

               '''Экран: 6,1-дюймовый OLED (2556×1179; 60 Гц)
Процессор: A16 Bionic
Оперативная память: 6 ГБ
Память с возможностью расширения: 128 ГБ, 256 ГБ, 512 ГБ / нет
Задняя камера: 48МП (f/1,6) с 2-кратным зумом, 12МП сверхширокая (ƒ/2,4)
Фронтальная камера: камера: 12 МП (ƒ/1,9)
Вес: 171 г
Время работы от аккумулятора (часы:минуты): 11:05''',

               '''Размер экрана: 6,4-дюймовый Super AMOLED (1080 x 2340)
Задние камеры: 50-мегапиксельная основная, 12-мегапиксельная ультраширокая
Фронтальная камера: 32-мегапиксельная
Вес: 202 г
Размеры: 152,2 x 71,8 x 8,9 мм
Память: 128 ГБ — 256 ГБ
Оперативная память: 8 ГБ''',

               '''Экран: 6,1-дюймовый OLED (2556×1179; 120 Гц)
Процессор: A17 Pro
Оперативная память: 8 ГБ
Память с возможностью расширения: 128 ГБ, 256 ГБ, 512 ГБ, 1 ТБ / нет
Задняя камера: 48МП (диафрагма f/1,8) с 2-кратным зумом, 12МП сверхширокоугольная (ƒ/2,2) ), 12 МП, 3-кратный телеобъектив (f/2,8)
Фронтальная камера: 12 МП (ƒ/1,9)
Вес:
Время работы от аккумулятора (часы:минуты): 10:53''',

               '''Дата выпуска: февраль 2023 г
Вес: 168 г
Размеры: 146,3 х 70,86 х 7,62 мм
ОС: Андроид 13
Размер экрана: 6,1 дюйма
Разрешение: 2340 х 1080
Процессор: Qualcomm Snapdragon Gen 8 2 для Galaxy
Оперативная память: 8 ГБ
Память: 128 ГБ/256 ГБ
Емкость батареи: 3900 мАч
Задняя камера: 50 МП (широкая), 12 МП (сверхширокая), 10 МП (телефото)
Фронтальная камера: 12 МП''',

               '''Дата выхода: май 2023 г.
Вес: 193,5 г
Размеры: 72,9 x 152 x 9 мм
ОС: Андроид 13
Размер экрана: 6,1 дюйма
Разрешение: 2400 x 1080
Процессор: Tensor G2
Оперативная память: 8 ГБ
Память: 128 ГБ
Аккумулятор: 4385 мАч
Задняя камера: 64 МП
Фронтальная камера: 13 МП''',

               '''Экран: 6,7-дюймовый AMOLED (3216 x 1440; 1–120 Гц) 
Процессор: Snapdragon 8 Gen 2 
Оперативная память: 8 ГБ, 16 ГБ 
Память: 128 ГБ, 256 ГБ 
Задние камеры: 50 МП (f/1,8) основная, 48 МП (f/2,2) сверхширокая, 32 МП (f/2.0) 2x телеобъектив 
Фронтальная камера: 16 МП (f/2.45) 
Вес: 204 г
Время работы батареи (часы:минуты): 13:10 (адаптивная), 12:48 (60 Гц)''',

               '''Экран: 6,7-дюймовый OLED (1080 х 2400)
ЦП: Tensor G2
Оперативная память: 8 ГБ
Хранение: 128 ГБ, 256 ГБ
Задние камеры: 50 МП + 12 МП
Фронтальная камера: 10,8 МП
Вес: 197 г
Емкость батареи: 4355 мАч''',

               '''Изображение Смартфон Apple iPhone SE 2022
Реклама, ООО Яндекс, ИНН 7736207543, erid: 4CQwVszL78EMgDAtqfN
СМОТРЕТЬ В Я.МАРКЕТ
Экран: 4,7-дюймовый ЖК-дисплей (1344 x 750)
Процессор: A15 Bionic
Оперативная память: 4 ГБ
Хранилище / Расширяемое: 64 ГБ, 128 ГБ, 256 ГБ / Нет
Задняя камера: 12 МП (f/1.8)
Фронтальная камера: 7 МП (f/2.2)
Вес: 144 г
Время работы батареи (часы:минуты): 9:05''',

               '''Дата выпуска: июль 2023 г.
Вес: 253 г
Размеры: 155 х 130 х 6 мм / 155 х 67 х 13,5 мм
ОС: Андроид 13
Размер экрана: 7,6 дюйма / 6.2 дюйма
Разрешение: 2176 x 1812 / 2316 x 904
Процессор: Snapdragon 8 Gen 2 for Galaxy
Оперативная память: 12 ГБ
Память: 256 ГБ, 512 ГБ, 1 ТБ
Аккумулятор: 4400 мАч
Задняя камера: 50 МП (основная) + 12 МП (сверхширокоугольная) + 10 МП (телеобъектив с трехкратным оптическим зумом)
Фронтальная камера: 10 МП''',

               '''Экран: 5.92″ (2400×1080) Super AMOLED 144 Гц
Память хранения: 256 ГБ
Оперативная помять: 8 ГБ
Фотодвойная камера, основная: 50 МП
Аккумулятор: 4300 мА·ч
Процессор: Qualcomm Snapdragon 8 Gen2
SIM-карты: Dual nano SIM
Операционная система: Android 13
Беспроводные интерфейсы: Bluetooth, NFC, Wi-Fi
Стандарт связи: 2G, 3G, 4G LTE, 5G
Степень защиты: IP68
Вес: 172 г''',

               '''Дата выпуска: июнь 2023 г.
Задняя камера: 48 МП (24 мм, f/1,9) (широкоугольная); 12 МП (85 мм, f/2,3); 12 МП (16 мм, f/2,2)
Фронтальная камера: 12 Мп (f/2)
Диафрагма задней камеры: f/1.9 + f/2.3 + f/2.2
Размеры: 165 х 71 х 8,3 мм
Вес: 187 г
Память: 256 ГБ + слот для карт памяти microSD''',

               '''Дата выпуска: июль 2023 г.
Вес: 187 г
Размеры:
ОС: Андроид 13
Размер экрана: 6,7 дюйма / 3,4 дюйма
Разрешение: 2640 x 1080 / 720 x 748
Процессор: Snapdragon 8 Gen 2 for Galaxy
Оперативная память: 8 ГБ
Память: 256 ГБ, 512 ГБ
Аккумулятор: 3700 мАч
Задняя камера: 12 МП + 12 МП
Фронтальная камера: 10 МП''',
               ]

mobile_phone = ['Samsung Galaxy S23 Ultra', 'iPhone 15 Pro Max', 'Google Pixel 7 Pro', 'iPhone 15',
                'Samsung Galaxy A54', 'iPhone 15 Pro', 'Samsung Galaxy S23', 'Google Pixel 7a', 'OnePlus 11',
                'Google Pixel 7', 'iPhone SE (2022 г.)', 'Samsung Galaxy Z Fold 5', 'ASUS Zenfone 10',
                'Sony Xperia 1 V', 'Samsung Galaxy Z Flip 5',
                ]

description_id = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
price = [149990, 169990, 67638, 96990, 30288, 142070, 66990, 40160, 69316, 48490, 50820, 147135, 64445, 99840, 82377]
rating = [5, 5, 5, 5, 5, 4, 4, 3, 4, 1, 2, 4, 2, 3, 1]
title = [
        '''Шедевр благодаря совершенно новому уровню четкости фото и видео в условиях слабой освещенности и невероятной 
        детализации снимков на камеру 200МП. Самый мощный процессор в смартфоне Galaxy справится с задачами любой 
        сложности: скорость – его стихия.''',

         '''Король среди смартфонов: огромный экран, мощный процессор и инновационная камера.
         Передовые технологии и стильный дизайн в одном устройстве.''',

         '''Pixel от компании Google стало ещё быстрее с процессором Google Tensor G2, служащим для обработки множества различных 
         задач одновременно, и чипом безопасности Titan M2, отвечающим за сохранность всех ваших данных.''',

         '''Ваш идеальный спутник в мире безграничных возможностей!
         Новый iPhone 15 открывает двери в мир передовых технологий и непревзойденного дизайна.''',

         '''Стильный и функциональный смартфон с двумя SIM-картами.''',

         '''Встречайте мощный и стильный iPhone с передовыми технологиями!''',

         '''Galaxy S23 выделяется тем, что переопределяет основные элементы мобильного интерфейса премиум-класса.''',

         '''Pixel 7a доступен в четырех ярких цветах, включая Coral, эксклюзивный для Google Store. И он сделан из переработанного 
         алюминия, стекла и пластика. ''',

         '''OnePlus 11 получил 10-битный изогнутый 6,7-дюймовый дисплей с разрешением 3216x1440 пикселей и частотой дискретизации 
         1000 Гц. Главная его особенность — поддержка плавного изменения частоты обновления от 1 до 120 Гц с почти нулевой 
         задержкой с помощью новейшей технологии LTPO 3.0. Это первый в мире смартфон, в котором присутствует такая технология.''',

         '''Google Pixel 7 теперь быстрее, отзывчивее и безопаснее. Его 6.3-дюймовый экран стал на 25% ярче, позволяя работать со 
         смартфоном даже в яркие солнечные дни, адаптивная батарея разумнее распределяет ресурсы, за счёт чего Pixel 7 работает 
         дольше, а обновлённая камера поразит вас богатством красок и чёткостью снимков.
         Pixel 7 - на страже экологии! Компания Google заботится о загрязнении окружающей среды, поэтому корпус смартфона был 
         произведён из 100% переработанного алюминия.''',

         '''Когда речь заходит об iPhone SE (2022), вы действительно можете рассчитывать на довольно многое за свои деньги. 
         Новейший бюджетный iPhone превосходит все остальные в этой ценовой категории и даже утирает нос самым дорогим телефонам 
         на Android. С тем же A15 Bionic, что и в iPhone 13, SE — это маленький зверь.''',

         '''Galaxy Z Fold 5, возможно, не имеет значительного обновления по сравнению со своим предшественником, но это идеальный 
         смартфон для технических энтузиастов, которым нужно устройство, способное на все. ''',

         '''Концепция компактных Android-флагманов мертва? Подождите, Asus так не думает. Если вы скучаете по старым дням, 
         когда производители телефонов соревновались в уменьшении своих устройств, есть вариант, и он просто великолепен. 
         Asus совершенствовала свою линейку Zenfone за последние несколько лет, и Zenfone 10 является вершиной всех этих усилий.''',

         '''Существует один бренд, который упорно стоит на своем и продолжает разрабатывать телефоны с соотношением сторон 21:9 
         с великолепными дисплеями, профессиональным программным обеспечением, инновационным оборудованием и массой функций, 
         которых нет в других телефонах. Правильно, это Sony!''',

         '''Помните, как в 2020 году была представлена серия Galaxy Flip, предлагающая свежий взгляд на классический 
         телефон-раскладушку, которые были популярны в 2000-х годах? Этот новый стиль складного телефона стал крупным 
         технологическим достижением. Samsung пришлось решить множество инженерных проблем, чтобы создать эту новую форму.''',
]

